"""
元组定义还可以通过类实例化方式定义
    元组名 = tuple()

元组和列表一样，都可用于存储多个数据，不同之处在于元组的元素不能修改

"""

# 定义元组
tuple1 = ("jack", 18, 176.5, {"age": 20}, [1, 2, 3])

#打印元组及元组类型
print(tuple1, type(tuple1))

#打印元组指定数据：通过下标获取
print(tuple1[2])

#使用元组交换两个变量的值
num1 = 100
num2 = 200
num2, num1 = num1, num2
print(num1)
print(num2)

#定义元组存储测试账号
print("-" * 80)
tuple2 = ("13488888888","","aaaaaabbbbb","1341234567","13612345678")
#遍历元组数据进行测试账号校验
for i in tuple2:
    #当手机号为“13488888888"，输出“账号成功"；否则"账号错误"
    if i== "13488888888":
        print("账号正确")
    else:
        print("账号错误")